{
  "education.heroTitle": "$t(nav.home.education)",
  "education.heroDesc": "We teach sofware engineer students at the BSc, MSc and PhD level; our elective courses offer exciting and state-of-the-art topics.",
  "education.talentcare.title": "$t(nav.education.talentcare)",
  "education.studentwork.title": "$t(nav.education.studentwork)",
  "education.achievements.title": "$t(nav.education.achievements)",
  "education.specializations.title": "$t(nav.education.specializations)",
  "education.subjects.title": "$t(nav.education.courses)",

  "education.talentcare.p1": "Motivated students can start to work with us even in the beginning of their undergraduate studies, and later join our international research and innovation projects or one of our open source developments.",
  "education.talentcare.p2": "We offer special talent care opportunities and unique one-on-one mentoring for our talented students.",

  "education.studentwork.description": "Our students can start to work on engaging topics during their first <0>project work</0> course. We offer project and thesis topics ranging from practical developments inspired by our industrial partners to challenging research problems with strong theoretical background. Our goal is to find topics for students, where they can deepen their knowledge and improve their skills.",
  "education.studentwork.pageNumber": "page {{pageNumber}}",
  "education.studentwork.card1.title": "Systems Engineering (BSc)",
  "education.studentwork.card1.desc": "The systems thinking approach is illustrated in the courses, but the material is hands-on and can be used in the practice. I was able to find the joy of research, the research groups pays attention to the individual work of the students.”",
  "education.studentwork.card2.title": "Critical Systems (MSc)",
  "education.studentwork.card2.desc": "Both the BSc and MSc specialization outperformed my initial expectations. I have not thought before that are so many exciting at the research group.”",

  "education.subjects.types.bsc": "BSc",
  "education.subjects.types.bscSpec": "BSc specialization",
  "education.subjects.types.bscElective": "BSc elective",
  "education.subjects.types.msc": "MSc",
  "education.subjects.types.mscSpec": "MSc specialization",
  "education.subjects.types.elective": "Elective",
  "education.subjects.types.phd": "PhD",
  "education.subjects.webPage": "Web",
  "education.subjects.portalPage": "Datasheet",

  "education.subjects.softeng.title": "Software Engineering",
  "education.subjects.softeng.heading": "Engineering Aspects of Software Development",
  "education.subjects.softeng.desc": "The subject aims to teach the design, development, and maintenance of software systems, presenting the tools and methods necessary for producing software as a product.",

  "education.subjects.remo.title": "System Modeling",
  "education.subjects.remo.heading": "Fundamental Processes and Tools of Model-Based System Design",
  "education.subjects.remo.desc": "Our comprehensive subject builds upon previous courses in the curriculum to demonstrate model-based system design through relevant industry examples and tools.",

  "education.subjects.ase.title": "Automated Software Engineering",
  "education.subjects.ase.heading": "Methods and Tools for Automated Software Development",
  "education.subjects.ase.desc": "The subject introduces the process of designing new languages, enhancing developer environments, implementing continuous integration, and executing various testing and performance measurement techniques with statistical analysis.",

  "education.subjects.form.title": "Formal Methods",
  "education.subjects.form.heading": "Using formal methods for design, implementation and analysis",
  "education.subjects.form.desc": "Students learn to create formal models and become familiar with various formal methods and technologies, their advantages, disadvantages, and basic tools.",

  "education.subjects.mdsd.title": "Model-based Software Development",
  "education.subjects.mdsd.heading": "Technologies for domain-specific modeling and tool development",
  "education.subjects.mdsd.desc": "We introduce the use of domain-specific modeling languages in the context of model-based software design processes and industrial implementation technologies.",

  "education.subjects.rdds.title": "Reliable Distributed and Decentralized Systems",
  "education.subjects.rdds.heading": "Cloud-Based, Autonomous, Adaptive/Reconfigurable Systems",
  "education.subjects.rdds.desc": "We review key technologies related to distributed and decentralized systems, emphasizing algorithmic, modeling, and service security aspects.",

  "education.subjects.avt.title": "Automated Verification Techniques",
  "education.subjects.avt.heading": "Modern Testing and Verification Techniques, Tools",
  "education.subjects.avt.desc": "The objective of the subject is to acquaint students with various verification techniques applicable throughout the entire software and system development life cycle.",

  "education.subjects.thrustAI.title": "Trustworthy AI and Data Analysis",
  "education.subjects.thrustAI.heading": "Reliability Aspects of Artificial Intelligence and Data Analysis",
  "education.subjects.thrustAI.desc": "The aim of the subject is for students to understand the reliability aspects of artificial intelligence and data analysis and integrate them into the software development process.",

  "education.subjects.swvv.title": "Software Verification and Validation",
  "education.subjects.swvv.heading": "Mathematical foundations of formal V&V methods",
  "education.subjects.swvv.desc": "The aim of the subject is to provide a systematic overview of verification and validation methods used in software development, emphasizing the mathematical foundations of formal verification techniques.",

  "education.subjects.emprete.title": "Empirical Systems Engineering and Modeling",
  "education.subjects.emprete.heading": "Assuring extra-functional properties during design and operations",
  "education.subjects.emprete.desc": "We present techniques that bridge the continuous world of metrics with discrete qualitative models of computer systems, touching upon key application areas.",

  "education.subjects.blockchain.title": "Blockchain Technologies and Applications",
  "education.subjects.blockchain.heading": "Technologies and tools for designing blockchain-based systems",
  "education.subjects.blockchain.desc": "The subject emphasizes the creation and integration of general-purpose business services and Cyber-Physical Systems (CPS) application cases.",

  "education.subjects.maviz.title": "Data Analysis and Visualizaton for Engineers",
  "education.subjects.maviz.heading": "How to turn data into information using visual methods?",
  "education.subjects.maviz.desc": "We introduce students to the application possibilities of visual data analysis, primarily in the design and evaluation of computer systems.",

  "education.specializations.swdev.title": "Software Engineering (BSc and MSc)",
  "education.specializations.swdev.subtitle": "Programming is easy, but high quality software is hard",
  "education.specializations.swdev.p1": "The goal of the specialization is to teach contemporary development technologies and tools that can be used to design, code, and verify software.",
  "education.specializations.swdev.p2": "",
  "education.specializations.critsys.title": "Critical Systems (MSc)",
  "education.specializations.critsys.subtitle": "High expectations necessitates quality work",
  "education.specializations.critsys.p1": "The mission of the Critical System MSc specialization is to educate leading software and systems engineers, who are capable of designing, developing, and verifying critical software systems, and can easily join the global job market.",
  "education.specializations.critsys.p2": "",

  "education.achievements.publications.title": "Joint publications",
  "education.achievements.publications.desc": "Research results with our students are published in prestigous publications. For example, in the recent years we had joint publications at the <0>EMSOFT</0> conference (New York) or in the <1>STTT</1> and <2>STVR</2> leading journals.",
  "education.achievements.workplaces.title": "Typical workplaces",
  "education.achievements.workplaces.desc": "Our students have no problem in finding the perfect job. You can find our past students at start-ups, big tech companies or international R&D centers, frequently in senior positions.",
  "education.achievements.scholarships.title": "Awards and scholarships",
  "education.achievements.scholarships.desc": "Our students perform exceptionally well on <0>university</0> or <1>national</1> student research competations and scholarships. They take part in various international visits and summer schools (e.g. in Switzerland or Germany)."
}
