{
  "home.projects.title": "$t(nav.home.projects)",
  "home.competences.title": "TODO Szakmai kompetenciáink",
  "home.competences.description": "TODO Fő területünk a kritikus informatikai rendszerek, folyamatok és platformok szolgáltatásbiztonságra tervezése, ideértve a kiberfizikai és informatikai infrastruktúrákat, alkalmazásokat. Alapvető metodikánk a modellalapú tervezés, analízis és helyességbizonyítás.",
  "home.competences.c1.title": "TODO Kritikus rendszerek fejlesztése",
  "home.competences.c1.desc": "TODO Módszertanok, fejlesztési környezetek, technikák és technológiák a modellalapú kritikus informatikai és kiberfizikai rendszerek és alkalmazások tervezésére.",
  "home.competences.c2.title": "TODO Ellenőrzés és tesztelés",
  "home.competences.c2.desc": "TODO Formális módszerek és modellalapú tesztelés alkalmazása funkcionális, megbízhatósági, biztonsági és teljesítmény követelmények ellenőrzése és tanúsítása során.",
  "home.competences.c3.title": "TODO Empirikus rendszertervezés",
  "home.competences.c3.desc": "TODO Teljesítmény és megbízhatósági követelmények kísérleti vizsgálata, mérése, analízise, méretezése származtatott modellek alapján, hibamodellezés.",
  "home.education.title": "$t(pages.education.heroTitle)",
  "home.education.card1.category": "TODO Oktatás",
  "home.education.card1.title": "TODO Képzésünk lefedi a kritikus rendszerek tervezésének, analízisének és üzemeltetésének legfontosabb területeit",
  "home.education.card1.desc": "TODO Három szakiránnyal (Rendszertervezés és Szoftverfejlesztés BSc-n, Kritikus rendszerek MSc-n) és több mint 12 tárggyal várjuk az érdeklődő hallgatókat.",
  "home.education.card2.category": "TODO Tehetséggondozás",
  "home.education.card2.title": "TODO Kiemelt figyelmet fordítunk a tehetséggondozásra, hallgatóink előkelő helyezéseket szereznek a kari és országos TDK-n",
  "home.education.card2.desc": "TODO Hallgatóink számos innovatív projekten dolgoznak, amelyek nemritkán önálló tudományos eredményekhez és ipari együttműködésekhez vezetnek.",
  "home.education.card3.category": "TODO Díjak, pályázatok",
  "home.education.card3.title": "TODO Hallgatóink minden évben kiválóan szerepelnek a tanulmányi és kutatói pályázatokon, ösztöndíjakon",
  "home.education.card3.desc": "TODO Külföldi tanulmányutak, Rektori Különdíj, Új Nemzeti Kiválóság Program, Nemzeti Felsőoktatási Ösztöndíj, Kari és Egyetemi BME Ösztöndíjak...",
  "home.about.title": "$t(nav.home.about)",
  "home.about.p1": "TODO Fő területünk a kritikus informatikai rendszerek, folyamatok és platformok tervezése, ellenőrzése és üzemeltetésének támogatása. A magas színvonalat nemcsak a tervezett rendszerekkel szemben várjuk el, hanem a kutatás és oktatás területén is magunkénak valljuk.",
  "home.about.p2": "TODO A BME VIK Méréstechnika és Információs Rendszerek Tanszékén működő Hibatűrő Rendszerek Kutatócsoportot (ftsrg) 1994-ben alapította Prof. Pataricza András a hibatűrő számítástechnika kutatására és oktatására. A csoport az azóta eltelt években a rendszermodellezés, tervezés és ellenőrzés nemzetközileg jegyzett kutatócsoportjává vált, harmincnál is több európai kutatási és ipari együttműködésben kamatoztatva tudását. 2019-től megújult arculattal, Kritikus Rendszerek Kutatócsoport (Critical Systems Research Group) néven, de a jól bevált „ftsrg” rövidítéssel és mentalitással folytatjuk az első 25 év hagyományait.",
  "home.about.p3": "TODO Bővebben a kutatócsoportról a <0>BME</0> és az <1>Impulzus</1> interjújában olvasható.",
  "home.partners.title": "TODO Partnereink",
  "home.news.title": "TODO Hírek és események",
  "home.counters.c1.title": "TODO Szakdolgozat és diplomaterv",
  "home.counters.c2.title": "TODO TDK és OTDK dolgozat",
  "home.counters.c3.title": "TODO Hallgatói díj és kitüntetés"
}
