{
  "home.competences.title": "$t(nav.home.competences)",
  "home.education.title": "$t(nav.home.education)",
  "home.about.title": "The research group",
  "home.projects.title": "$t(nav.home.projects)",
  "home.partners.title": "$t(nav.home.partners)",
  "home.news.title": "$t(nav.home.news)",
  "home.competences.description": "Our main area is the design and development of critical software systems, including smart embedded and cyber-physical systems, business, distributed and blockchain-based applications. Our main goal is to provide tools, algorithms and methods for the development of high-quality systems. Our competencies include model-based software and system design, automatized software development, analysis and verification.",
  "home.competences.c1.title": "Developing critical systems",
  "home.competences.c1.desc": "Methods, techniques and tools to develop model-based critical software and cyber-physical systems and application.",
  "home.competences.c2.title": "Verification and testing",
  "home.competences.c2.desc": "Applying formal methods and model-based testing to verify and certify functional, reliability, safety and performance requirements.",
  "home.competences.c3.title": "Empirical system design",
  "home.competences.c3.desc": "Empirical analysis, measurement and scaling of performance and reliability requirements based on qualitative models and fault modelling.",
  "home.education.card1.category": "Education",
  "home.education.card1.title": "Our courses cover the main topics of designing, analyzing and verifying critical systems",
  "home.education.card1.desc": "We provide two specializations (Software Engineering at BSc, Critical Systems at MSc) and more than 12 courses for interested students.",
  "home.education.card2.category": "Talent care",
  "home.education.card2.title": "Talent care is our top priority; our students are awarded regularly on international competitions",
  "home.education.card2.desc": "Our students participate in many innovative projects, from which new scientific results, open-source tools or industry collaborations emerge.",
  "home.education.card3.category": "Awards and scholarships",
  "home.education.card3.title": "Every year our students perform remarkably on excellence and research scholarships",
  "home.education.card3.desc": "Research visits, Rector's Award, University Research Scholarship Programme, National Higher Education Scholarship, University and Faculty Scholarships...",
  "home.about.p1": "Our main area is the design, verification, and analysis of critical software systems. High quality is not only the overarching attribute of our application domains, but it is in our DNA for research and education.",
  "home.about.p2": "Prof. András Pataricza founded the Fault Tolerant Systems Research Group (ftsrg) in 1994 at the Department of Artificial Intelligence and Systems Engineering of BME VIK. In the coming decade, ftsrg evolved into an internationally recognized research group in systems modeling, engineering and verification, participating in more than twenty EU-level R&D collaborative projects. From 2019, we continue the traditions of the first 25 years with a new design and the Critical Systems Research Group name while keeping the same „ftsrg” acronym and enthusiasm.",
  "home.about.p3": "",
  "home.counters.c1.title": "BSc and MSc thesis works",
  "home.counters.c2.title": "Student Scientific Reports",
  "home.counters.c3.title": "Student awards"
}
