{
  "home.competences.title": "$t(nav.home.competences)",
  "home.education.title": "$t(nav.home.education)",
  "home.about.title": "The research group",
  "home.projects.title": "$t(nav.home.projects)",
  "home.partners.title": "$t(nav.home.partners)",
  "home.news.title": "$t(nav.home.news)",
  "home.competences.description": "Our main area is the resilient design of critical software systems, processes and platforms, including cyber-physical systems. Our main competencies are model-based design, analysis and verification.",
  "home.competences.c1.title": "Developing critical systems",
  "home.competences.c1.desc": "Methods, techniques and tools to develop model-based critical software and cyber-physical systems and application.",
  "home.competences.c2.title": "Verification and testing",
  "home.competences.c2.desc": "Applying formal methods and model-based testing to verify and certify functional, reliability, safety and performance requirements.",
  "home.competences.c3.title": "Empirical system design",
  "home.competences.c3.desc": "Empirical analysis, measurement and scaling of performance and reliability requirements based on qualitative models and fault modelling.",
  "home.education.card1.category": "Education",
  "home.education.card1.title": "Our courses cover the main topics of designing, analyzing and verifying critical systems",
  "home.education.card1.desc": "We provide three specializations (Systems and Sofware Engineering at BSc, Critical Systems at MSc) and more than 12 courses for interested students.",
  "home.education.card2.category": "Talent care",
  "home.education.card2.title": "TODO Kiemelt figyelmet fordítunk a tehetséggondozásra, hallgatóink előkelő helyezéseket szereznek a kari és országos TDK-n",
  "home.education.card2.desc": "TODO Hallgatóink számos innovatív projekten dolgoznak, amelyek nemritkán önálló tudományos eredményekhez és ipari együttműködésekhez vezetnek.",
  "home.education.card3.category": "Awards and scholarships",
  "home.education.card3.title": "TODO Hallgatóink minden évben kiválóan szerepelnek a tanulmányi és kutatói pályázatokon, ösztöndíjakon",
  "home.education.card3.desc": "TODO Külföldi tanulmányutak, Rektori Különdíj, Új Nemzeti Kiválóság Program, Nemzeti Felsőoktatási Ösztöndíj, Kari és Egyetemi BME Ösztöndíjak...",
  "home.about.p1": "TODO Fő területünk a kritikus informatikai rendszerek, folyamatok és platformok tervezése, ellenőrzése és üzemeltetésének támogatása. A magas színvonalat nemcsak a tervezett rendszerekkel szemben várjuk el, hanem a kutatás és oktatás területén is magunkénak valljuk.",
  "home.about.p2": "TODO Prof. András Pataricza founded the Fault Tolerant Systems Research Group (ftsrg) in 1994 at the Department of Measurement and Information Systems of BME VIK. A csoport az azóta eltelt években a rendszermodellezés, tervezés és ellenőrzés nemzetközileg jegyzett kutatócsoportjává vált, harmincnál is több európai kutatási és ipari együttműködésben kamatoztatva tudását. 2019-től megújult arculattal, Kritikus Rendszerek Kutatócsoport (Critical Systems Research Group) néven, de a jól bevált „ftsrg” rövidítéssel és mentalitással folytatjuk az első 25 év hagyományait.",
  "home.about.p3": "",
  "home.counters.c1.title": "BSc and MSc thesis works",
  "home.counters.c2.title": "Student Scientific Reports",
  "home.counters.c3.title": "Student awards"
}
