{
  "research.projects.title": "TODO K+F+I projektjeink",
  "research.projects.description": "TODO A kutatócsoport az elmúlt 25 évben több mint húsz nagy EU-s kutatási projektben (FP4-H2020) és 25-nél is több közvetlen ipari együttműködésben vett részt. Kutatás-fejlesztési projektjeinkben olyan új, innovatív szoftveralapú megoldásokat hozunk létre, amelyek jelentősen megkönnyítik a mérnökök munkáját.",
  "research.projects.counter1.title": "TODO EU-s kutatási projekt",
  "research.projects.counter2.title": "TODO Ipari együttműködés",
  "research.projects.counter3.title": "TODO Hazai és bilaterális projekt",
  "research.publications.title": "TODO Publikációk",
  "research.publications.fullPubList": "TODO Teljes publikációs lista",
  "research.publications.dataSets": "TODO Adathalmazok",
  "research.publications.description": "TODO Kutatócsoportunk rendszeresen publikál a szoftvertechnológia (TSE, IST, STTT), modellalapú fejlesztés (MODELS, SoSyM), a formális verifikáció (TACAS, JAR) és a szoftvertesztelés (ICST, STVR) vezető konferenciáin és folyóirataiban.",
  "research.events.title": "TODO Események és díjak",
  "research.tools.title": "TODO Eszközeink",
  "research.tools.tool1.title": "TODO A Gamma állapotgép-kompozíciós keretrendszer",
  "research.tools.tool1.desc": "TODO A Gamma modellezőeszköz reaktív rendszerek komponensalapú tervezését, formális ellenőrzését, illetve implementációjának automatikus előállítását teszi lehetővé.",
  "research.tools.tool2.title": "TODO A Theta modellellenőrző keretrendszer",
  "research.tools.tool2.desc": "TODO A Theta modellellenőrző keretrendszer absztrakció-finomítás alapú, korszerű algoritmusok kollekciója, amelyek kombinálhatóságuk révén mindig az adott problémához szabhatók.",
  "research.tools.tool3.title": "TODO A VIATRA Solver gráfgenerátor keretrendszer",
  "research.tools.tool3.desc": "TODO A VIATRA Solver egy keretrendszer, amely szakterület-specifikus nyelvek jólformált és változatos példánymodelljeinek automatikus és skálázódó generálására szolgál.",

  "research.publications.autoGenGraphModel": "TODO Olyan módszereket javasoltunk, amivel gráfok generálása során adott célfüggvény szerinti optimalizációs problémákat tudunk megoldani.",
  "research.publications.autoIsoWhitebox": "TODO Olyan módszert és eszközt készítettünk, ami forráskód-alapú tesztgenerálás során a tesztelt modul izolációja érdekében automatikusan mock környezeteket generál.",
  "research.publications.faultInjectBlockchain": "TODO A Coimbrai Egyetem kutatóival együttműködve olyan módszert javasoltunk, amivel blockchain rendszerek megbízhatósága vizsgálható.",
  "research.publications.stratForCEGAR": "TODO Hatékony algoritmusokat javasoltunk a CEGAR-alapú modellellenőrzés továbbfejlesztéséhez, amik a mérések alapján beágyazott szoftver és PLC kódok ellenőrzését segítik.",

  "research.projects.ADVANCE": "TODO A BME részvételével 2019 januárjában elindult az „Addressing Verification and Validation Challenges in Future Cyber-Physical Systems” (ADVANCE) nevű H2020 RISE kutatási projekt, ami a jövő kiberfizikai rendszereinek ellenőrzési kihívásait fogja vizsgálni. A projekt futamideje 4 év és teljes költségvetése € 657 800.",
  "research.projects.arrowheadtools": "TODO A BME TMIT és MIT részvételével 2019 májusában elindult az „Arrowhead Tools” H2020 ECSEL projekt, ami Európa legnagyobb, ipari digitalizációs és automatizálási megoldásokat fejlesztő K+F+I projektje. A projektben több mint 80 partner vesz részt, köztük az AITIA, evopro Innovation és az IncQuery Labs.",
  "research.projects.blockchain": "TODO Az EIT Digital Professional School keretében kidolgozunk egy olyan tanfolyamsorozatot, ami bemutatja, hogy hogyan lehet a blockchain technológiákat beépíteni egy cég üzletmenetébe és innovatív szolgáltatásaibe.",
  "research.projects.EMBrACE": "TODO A BME részvételével elindult az „Environment for model-based rigorous adaptive co-design and operation of CPS” (EMBrACE) című ITEA 3 projekt. Az IncQuery Labs és további húsz partner együttműködésével készítünk komplex ipari rendszerek tervezéséhez innovatív mérnöki nyelveket és eszközöket.",
  "research.projects.allPrevious.title": "TODO Korábbi projektjeink",
  "research.projects.allPrevious.subtitle": "TODO FP4-től H2020-ig",
  "research.projects.allPrevious.desc": "TODO EU keretprogramok (EEMCN, FUTEG, HIDE, DECOS, RESIST, Sensoria, Deserec, Diana, Hidenets, SafeDMI, Amber, Genesys, Mogentes, SecureChange, E-freight, R3-COP, CECRIS, Concerto, MONDO, R5-COP...) és hazai kutatási pályázatok (MTA Lendület, ERC_HU, OTKA...)"
}
