{
  "education.heroTitle": "$t(nav.home.education)",
  "education.heroDesc": "A csoport a mérnökinformatikus BSc, MSc és PhD képzésben is jelen van, választható tárgyaink pedig izgalmas és naprakész tudást adnak hallgatóinknak.",
  "education.talentcare.title": "$t(nav.education.talentcare)",
  "education.studentwork.title": "$t(nav.education.studentwork)",
  "education.achievements.title": "$t(nav.education.achievements)",
  "education.specializations.title": "$t(nav.education.specializations)",
  "education.subjects.title": "$t(nav.education.courses)",

  "education.talentcare.p1": "A motivált, érdeklődő hallgatókat szívesen látjuk már a BSc tanulmányaik kezdetén. Ők később a közös munka során rendszeresen bekapcsolódnak nemzetközi kutatási és ipari projektjeinkbe, nyílt forráskódú szoftverfejlesztéseinkbe.",
  "education.talentcare.p2": "Számukra tehetséggondozó programot, kiemelt konzultációs hátteret és egyéni mentorálást biztosítunk a <0>TDK konferenciától</0> kezdve egészen a doktori képzés végéig.",

  "education.studentwork.pageNumber": "{{pageNumber}}. oldal",
  "education.studentwork.description": "Hallgatóink változatos témákon dolgozhatnak már a <0>témalabortól</0> kezdődően: az ipari partnereink által inspirált gyakorlati fejlesztési feladatoktól kezdve az elméleti jellegű kutatási témákig széles spektrumon biztosítunk konzultációt. Célunk, hogy hallgatóink olyan témákat találjanak, amikben elmélyülnek és szakmailag fejlődnek.",
  "education.studentwork.card1.title": "Rendszertervezés (BSc)",
  "education.studentwork.card1.desc": "„Ezt a fajta rendszerben gondolkodást jól tükrözi az oktatás, miközben a tanultak kellően konkrétak, gyakorlatban is hasznosak. Sikerült megtalálnom a kutatómunka örömét is, ugyanis a csoportban különösen figyelnek a hallgatók önálló szakmai tevékenységére.”",
  "education.studentwork.card2.title": "Kritikus rendszerek (MSc)",
  "education.studentwork.card2.desc": "„A BSc ágazat és az MSc szakirány messzemenően felülmúlta a korábbi elképzeléseimet és elvárásaimat. Nem gondoltam volna, hogy ennyi érdekes témával lehet itt foglalkozni.”",

  "education.subjects.webPage": "Web",
  "education.subjects.portalPage": "Adatlap",
  "education.subjects.types.bsc": "BSc",
  "education.subjects.types.bscSpec": "BSc szakirány",
  "education.subjects.types.msc": "MSc",
  "education.subjects.types.mscSpec": "MSc szakirány",
  "education.subjects.types.elective": "Választható",
  "education.subjects.types.phd": "PhD",

  "education.subjects.remo.title": "Rendszermodellezés",
  "education.subjects.remo.heading": "Az informatikai rendszerek tervezési folyamatának modellalapú megközelítései",
  "education.subjects.remo.desc": "A tantárgy célja a későbbi tantárgyak által megtanítandó specializált modellezési paradigmák előkészítése, az alapvető modellezési feladatok és eszközök bemutatásával.",
  "education.subjects.rete.title": "Informatikai rendszertervezés",
  "education.subjects.rete.heading": "A modellalapú rendszertervezés alapvető folyamatai és eszközei",
  "education.subjects.rete.desc": "Szakirányos tárgyunk a képzés korábbi tárgyaira építve a modellalapú rendszertervezést iparilag releváns példákon és eszközökön keresztül mutatja be.",
  "education.subjects.form.title": "Formális módszerek",
  "education.subjects.form.heading": "Formális modelleken alapuló tervezés és megvalósítás, formális analízis",
  "education.subjects.form.desc": "A hallgatók megtanulnak formális modelleket alkotni, illetve megismerik a különböző formális módszereket és technológiákat, ezek előnyeit, hátrányait, és alapvető eszközeit.",
  "education.subjects.mdsd.title": "Modellalapú rendszertervezés",
  "education.subjects.mdsd.heading": "Szakterület-specifikus modellezés és eszközfejlesztés technológiája",
  "education.subjects.mdsd.desc": "Bemutatjuk a szakterület-specifikus modellezési nyelvek használatát a modellalapú szoftvertervezési folyamat és az ipari implementációs technológiák szempontjából.",
  "education.subjects.cps.title": "Kiberfizikai rendszerek",
  "education.subjects.cps.heading": "Felhőalapú, autonóm, adaptív/átkonfigurálható beágyazott rendszerek",
  "education.subjects.cps.desc": "Áttekintjük a kiberfizikai rendszerekhez kapcsolódó kulcstechnológiákat, kiemelve az algoritmikus, modellezési és szolgáltatásbiztonsági aspektusokat.",
  "education.subjects.swsv.title": "Szoftver- és rendszerellenőrzés",
  "education.subjects.swsv.heading": "Automatikus ellenőrzési és tesztelési technikák, eszközök",
  "education.subjects.swsv.desc": "A tantárgy célkitűzése, hogy megismertesse a hallgatókat a teljes szoftver- és rendszerfejlesztési életciklus során alkalmazható különböző ellenőrzési technikákkal.",
  "education.subjects.swvv.title": "Szoftver verifikáció és validáció",
  "education.subjects.swvv.heading": "Formális verifikációs és validációs módszerek matematikai háttere",
  "education.subjects.swvv.desc": "A tárgy célja a szoftverfejlesztésben használatos verifikációs és validációs módszerek rendszerező ismertetése, hangsúlyozva a formális verifikációs technikák matematikai alapjait.",
  "education.subjects.emprete.title": "Empirikus rendszertervezés",
  "education.subjects.emprete.heading": "Extrafunkcionális tulajdonságok garantálása tervezéskor és üzemeltetéskor",
  "education.subjects.emprete.desc": "Bemutatjuk a metrikák folytonos világát és az informatikai rendszerek diszkrét kvalitatív modelljeit összekötő technikákat a legfontosabb alkalmazási területek érintésével.",
  "education.subjects.bigdata.title": "'Big Data' elemzési módszerek",
  "education.subjects.bigdata.heading": "Nagy adatmennyiségből adódó speciális problémák kezelése",
  "education.subjects.bigdata.desc": "A tárgy hallgatói megismerhetik a nagy méretű adathalmazok elemzésére szolgáló legfontosabb elemzési megközelítéseket és platformokat, beleértve az adatelemzés alapjait.",
  "education.subjects.blockchain.title": "Blockchain technológiák és alkalmazások",
  "education.subjects.blockchain.heading": "Blockchain eszközök alapvető tervezési elvei és sajátosságai, alkalmazásai",
  "education.subjects.blockchain.desc": "Az alkalmazások szempontjából kiemelt szerepű az általános célú üzleti szolgáltatások létrehozása és integrációja, valamint a kiberfizikai (Cyber-Physical Systems, CPS) alkalmazási esetek.",
  "education.subjects.devops.title": "DevOps",
  "education.subjects.devops.heading": "A rendszerfejlesztés és ‑üzemeltetés automatizálása és kapcsolódásai",
  "education.subjects.devops.desc": "A hallgatók megismerik az informatikai rendszerek fejlesztésének támogatásával és üzemeltetésével kapcsolatos technológiákat, háttérismereteket, és alkalmazásokat.",
  "education.subjects.maviz.title": "Mérési adatok vizuális elemzése",
  "education.subjects.maviz.heading": "Hogyan lesz az adatból információ? Hogyan találjuk meg a tűt a szénakazalban?",
  "education.subjects.maviz.desc": "Megismertetjük a hallgatókat a vizuális adatelemzés alkalmazási lehetőségeivel, elsődlegesen informatikai rendszerek tervezésében és kiértékelésében.",

  "education.subjects.datasheet.title": "A tárgy adatai",
  "education.subjects.datasheet.name": "A tárgy neve:",
  "education.subjects.datasheet.type": "Típus:",
  "education.subjects.datasheet.code": "Tárgykód:",
  "education.subjects.datasheet.seniorLecturer": "Tárgyfelelős:",
  "education.subjects.datasheet.instructors": "További oktatók:",

  "education.specializations.rete.title": "Rendszertervezés (BSc)",
  "education.specializations.rete.subtitle": "Tervezés és integráció a szoftveren innen és túl",
  "education.specializations.rete.p1": "Egy modern kiber-fizikai rendszer olyan megbízható és intelligens komponensekbol és szolgáltatásokból álló, döntően szoftveralapú nyílt rendszer, amely az Interneten keresztül közvetlen összeköttetésben áll a különféle mobil- és okoseszközökkel, a külvilágot érzékelő szenzorokkal és beavatkozókkal, a szinte korlátlan kapacitású számítási felhővel – és azokkal a kritikus alrendszerekkel is, amelyek helyes működésén életek múlnak.",
  "education.specializations.rete.p2": "A specializáció célja olyan rendszermérnökök képzése, akik képesek e modern rendszerek specifikálására, tervezésére, integrációjára, ellenőrzésére és megvalósítására egy felülről lefelé történő, modellcentrikus megközelítéssel, amely már napjainkban is domináns a kritikus rendszerek számos területén (pl. autó, repülőgép, gyógyászati berendezések, bioinformatika).",
  "education.specializations.swdev.title": "Szoftverfejlesztés (BSc)",
  "education.specializations.swdev.subtitle": "Programozni bárki megtanulhat, de jól csinálni nehéz",
  "education.specializations.swdev.p1": "A specializáció célja megismertetni a hallgatókat azokkal a kurrens szoftvertechnikákkal és eszközökkel, amelyek informatikai rendszerek megvalósításához, teszteléséhez, karbantartásához és dokumentálásához szükségesek.",
  "education.specializations.swdev.p2": "A specializáció kiemelt hangsúlyt fektet a legfrissebb szoftverirányzatok teljes spektrumának lefedésére, különös tekintettel a kliens oldalra és az informatikai háttérrendszerek fejlesztésére, a vonatkozó megvalósítási technikákra, heterogén platformok rendszerintegrációs elveire, olyan igényes grafikai információmegjelenítési és felhasználói interfész kialakítási módszerekre és fejlesztési technológiákra, amelyek követik a felhasználói igényeket, valamint a korszerű rendszerfejlesztési koncepcióknak való megfelelés követelményeire.",
  "education.specializations.critsys.title": "Kritikus rendszerek (MSc)",
  "education.specializations.critsys.subtitle": "A nagy felelősség minőségi munkát igényel",
  "education.specializations.critsys.p1": "A biztonság szempontjából kritikus rendszerekkel találkozunk például gépjárművek, vasutak és repülők fedélzeti rendszerei esetén, de ugyanilyen kiemelt jelentőségűek az üzletileg kritikus szolgáltatások és számítógépes infrastruktúrák is. Napjainkban e kritikus rendszerek 70-80%-át szoftver alkalmazások teszik ki. A kritikus rendszerek és szoftverek fejlesztése jelentősen eltér a hagyományos webes és mobil alkalmazásokétól.",
  "education.specializations.critsys.p2": "A Kritikus rendszerek MSc főspecializáció missziója, hogy olyan elit mérnökinformatikusokat képezzen ki, akik jártasak a kritikus rendszerek tervezésében, fejlesztésében, ellenőrzésében és üzemeltetésében, és bármilyen európai munkahelyen megállják a helyüket.",

  "education.achievements.publications.title": "Tudományos cikkek",
  "education.achievements.publications.desc": "Hallgatóinkkal elért közös eredményeink rangos tudományos publikációkban jelennek meg. Az elmúlt években például az <0>EMSOFT</0> konferencián (New York) vagy az <1>STTT</1> és <2>STVR</2> vezető folyóiratokban jelent meg hallgatókkal közösen írt cikkünk.",
  "education.achievements.workplaces.title": "Jellemző munkahelyek",
  "education.achievements.workplaces.desc": "Hallgatóinknak nem esik nehezükre elhelyezkedni a végzés után: start-up cégeknél, multinacionális cégek hazai vagy akár nemzetközi fejlesztőközpontjaiban mind-mind megtalálhatók volt hallgatóink, nem ritkán senior pozícióban.",
  "education.achievements.scholarships.title": "Pályázatok és ösztöndíjak",
  "education.achievements.scholarships.desc": "A <0>TDK</0> és <1>OTDK</1> versenyeken, <2>ÚNKP</2>, <3>NFÖD</3> és KBME pályázatokon hallgatóink minden évben kiemelkedően teljesítenek. Tanulmányaik alatt sokan külföldi ösztöndíjprogramokon és tanulmányutakon vesznek részt (pl. Svájc, Németország, Írország)."
}
