{
  "education.heroTitle": "$t(nav.home.education)",
  "education.heroDesc": "A csoport a mérnökinformatikus BSc, MSc és PhD képzésben is jelen van, választható tárgyaink pedig izgalmas és naprakész tudást adnak hallgatóinknak.",
  "education.talentcare.title": "$t(nav.education.talentcare)",
  "education.studentwork.title": "$t(nav.education.studentwork)",
  "education.achievements.title": "$t(nav.education.achievements)",
  "education.specializations.title": "$t(nav.education.specializations)",
  "education.subjects.title": "$t(nav.education.courses)",
  "education.talentcare.p1": "Tehetséges hallgatóink már a BSc képzés során rendszeresen bekapcsolódnak nemzetközi kutatási és ipari projektjeinkbe, nyílt forráskódú szoftverfejlesztéseinkbe.",
  "education.talentcare.p2": "Számukra tehetséggondozó programot és kiemelt konzultációs hátteret biztosítunk.",
  "education.studentwork.pageNumber": "{{pageNumber}}. oldal",
  "education.studentwork.description": "Hallgatóink változatos témákon dolgozhatnak már a <0>témalabortól</0> kezdődően: az ipari partnereink által inspirált gyakorlati fejlesztési feladatoktól kezdve az elméleti jellegű kutatási témákig széles spektrumon biztosítunk konzultációt. Célunk, hogy hallgatóink olyan témákat találjanak, amikben elmélyülnek és szakmailag fejlődnek.",
  "education.studentwork.card1.title": "Rendszertervezés (BSc)",
  "education.studentwork.card1.desc": "„Ezt a fajta rendszerben gondolkodást jól tükrözi az oktatás, miközben a tanultak kellően konkrétak, gyakorlatban is hasznosak. Sikerült megtalálnom a kutatómunka örömét is, ugyanis a csoportban különösen figyelnek a hallgatók önálló szakmai tevékenységére.”",
  "education.studentwork.card2.title": "Kritikus rendszerek (MSc)",
  "education.studentwork.card2.desc": "„A BSc ágazat és az MSc szakirány messzemenően felülmúlta a korábbi elképzeléseimet és elvárásaimat. Nem gondoltam volna, hogy ennyi érdekes témával lehet itt foglalkozni.”",
  "education.subjects.webPage": "Web",
  "education.subjects.portalPage": "Adatlap"
}
