{
  "home.competences.title": "$t(nav.home.competences)",
  "home.education.title": "$t(nav.home.education)",
  "home.about.title": "$t(nav.home.about)",
  "home.projects.title": "$t(nav.home.projects)",
  "home.partners.title": "$t(nav.home.partners)",
  "home.news.title": "$t(nav.home.news)",
  "home.competences.description": "Fő területünk a kritikus informatikai rendszerek, folyamatok és platformok szolgáltatásbiztonságra tervezése, ideértve a kiberfizikai és informatikai infrastruktúrákat, valamint az elosztott és blokkláncalapú alkalmazásokat. Célunk olyan eszközök, algoritmusok és módszerek fejlesztése, amik segítik a magas minőségű rendszerek fejlesztését. Alapvető metodikánk a modellalapú  szoftver- és rendszertervezés, automatizált szoftverfejlesztés, analízis és helyességbizonyítás.",
  "home.competences.c1.title": "Kritikus rendszerek fejlesztése",
  "home.competences.c1.desc": "Módszertanok, fejlesztési környezetek, technikák és technológiák a modellalapú kritikus informatikai és kiberfizikai rendszerek és alkalmazások tervezésére.",
  "home.competences.c2.title": "Ellenőrzés és tesztelés",
  "home.competences.c2.desc": "Formális módszerek és modellalapú tesztelés alkalmazása funkcionális, megbízhatósági, biztonsági és teljesítmény követelmények ellenőrzése és tanúsítása során.",
  "home.competences.c3.title": "Empirikus rendszertervezés",
  "home.competences.c3.desc": "Teljesítmény és megbízhatósági követelmények kísérleti vizsgálata, mérése, analízise, méretezése származtatott modellek alapján, hibamodellezés.",
  "home.education.card1.category": "Oktatás",
  "home.education.card1.title": "Képzésünk lefedi a kritikus rendszerek tervezésének, analízisének és üzemeltetésének legfontosabb területeit",
  "home.education.card1.desc": "Három szakiránnyal (Rendszertervezés és Szoftverfejlesztés BSc-n, Kritikus rendszerek MSc-n) és több mint 12 tárggyal várjuk az érdeklődő hallgatókat.",
  "home.education.card2.category": "Tehetséggondozás",
  "home.education.card2.title": "Kiemelt figyelmet fordítunk a tehetséggondozásra, hallgatóink előkelő helyezéseket szereznek a kari és országos TDK-n",
  "home.education.card2.desc": "Hallgatóink számos innovatív projekten dolgoznak, amelyek nemritkán önálló tudományos eredményekhez és ipari együttműködésekhez vezetnek.",
  "home.education.card3.category": "Díjak, pályázatok",
  "home.education.card3.title": "Hallgatóink minden évben kiválóan szerepelnek a tanulmányi és kutatói pályázatokon, ösztöndíjakon",
  "home.education.card3.desc": "Külföldi tanulmányutak, Rektori Különdíj, Új Nemzeti Kiválóság Program, Nemzeti Felsőoktatási Ösztöndíj, Kari és Egyetemi BME Ösztöndíjak...",
  "home.about.p1": "Fő területünk a kritikus informatikai rendszerek, folyamatok és platformok tervezése, ellenőrzése és üzemeltetésének támogatása. A magas színvonalat nemcsak a tervezett rendszerekkel szemben várjuk el, hanem a kutatás és oktatás területén is magunkénak valljuk.",
  "home.about.p2": "A BME VIK Mesterséges Intelligencia és Rendszertervezés Tanszékén működő Hibatűrő Rendszerek Kutatócsoportot (ftsrg) 1994-ben alapította Prof. Pataricza András a hibatűrő számítástechnika kutatására és oktatására. A csoport az azóta eltelt években a rendszermodellezés, tervezés és ellenőrzés nemzetközileg jegyzett kutatócsoportjává vált, húsznál is több európai kutatási és ipari együttműködésben kamatoztatva tudását. 2019-től megújult arculattal, Kritikus Rendszerek Kutatócsoport (Critical Systems Research Group) néven, de a jól bevált „ftsrg” rövidítéssel és mentalitással folytatjuk az első 25 év hagyományait.",
  "home.about.p3": "Bővebben a kutatócsoportról a <0>BME</0> és az <1>Impulzus</1> interjújában olvasható.",
  "home.counters.c1.title": "Szakdolgozat és diplomaterv",
  "home.counters.c2.title": "TDK és OTDK dolgozat",
  "home.counters.c3.title": "Hallgatói díj és kitüntetés"
}
