{
  "research.heroTitle": "$t(nav.research.title)",
  "research.heroDesc": "Út az alap és alkalmazott kutatáson át az innovációig",
  "research.projects.title": "$t(nav.research.projects)",
  "research.events.title": "$t(nav.research.events)",
  "research.publications.title": "$t(nav.research.publications)",
  "research.tools.title": "$t(nav.research.tools)",
  "research.projects.description": "A kutatócsoport az elmúlt 25 évben több mint húsz nagy EU-s kutatási projektben (FP4-H2020) és 25-nél is több közvetlen ipari együttműködésben vett részt. Kutatás-fejlesztési projektjeinkben olyan új, innovatív szoftveralapú megoldásokat hozunk létre, amelyek jelentősen megkönnyítik a mérnökök munkáját.",
  "research.projects.counter1.title": "EU-s kutatási projekt",
  "research.projects.counter2.title": "Ipari együttműködés",
  "research.projects.counter3.title": "Hazai és bilaterális projekt",
  "research.publications.fullPubList": "Teljes publikációs lista",
  "research.publications.dataSets": "Adathalmazok",
  "research.publications.slides": "Diasorok",
  "research.publications.description": "Kutatócsoportunk rendszeresen publikál a szoftvertechnológia (TSE, IST, STTT), modellalapú fejlesztés (MODELS, SoSyM), a formális verifikáció (TACAS, JAR) és a szoftvertesztelés (ICST, STVR) vezető konferenciáin és folyóirataiban.",
  "research.tools.tool1.title": "A Gamma állapotgép-kompozíciós keretrendszer",
  "research.tools.tool1.desc": "A Gamma modellezőeszköz reaktív rendszerek komponensalapú tervezését, formális ellenőrzését, illetve implementációjának automatikus előállítását teszi lehetővé.",
  "research.tools.tool2.title": "A Theta modellellenőrző keretrendszer",
  "research.tools.tool2.desc": "A Theta modellellenőrző keretrendszer absztrakció-finomítás alapú, korszerű algoritmusok kollekciója, amelyek kombinálhatóságuk révén mindig az adott problémához szabhatók.",
  "research.tools.tool3.title": "A VIATRA Solver gráfgenerátor keretrendszer",
  "research.tools.tool3.desc": "A VIATRA Solver egy keretrendszer, amely szakterület-specifikus nyelvek jólformált és változatos példánymodelljeinek automatikus és skálázódó generálására szolgál.",

  "research.publications.autoGenGraphModel": "Olyan módszereket javasoltunk, amivel gráfok generálása során adott célfüggvény szerinti optimalizációs problémákat tudunk megoldani.",
  "research.publications.autoGenQualitative": "Olyan új algoritmusokat javasoltunk, amik többféle megoldó kombinálásával képesek teszt forgatókönyvek automatikus generálására.",
  "research.publications.autoIsoWhitebox": "Olyan módszert és eszközt készítettünk, ami forráskód-alapú tesztgenerálás során a tesztelt modul izolációja érdekében automatikusan mock környezeteket generál.",
  "research.publications.faultInjectBlockchain": "A Coimbrai Egyetem kutatóival együttműködve olyan módszert javasoltunk, amivel blockchain rendszerek megbízhatósága vizsgálható.",
  "research.publications.stratForCEGAR": "Hatékony algoritmusokat javasoltunk a CEGAR-alapú modellellenőrzés továbbfejlesztéséhez, amik beágyazott szoftver és PLC kódok ellenőrzését segítik.",
  "research.publications.assessingModLanguage": "Módszereket javasoltunk, amivel modellezési nyelvek tervezése és felhasználása során a nyelv szemantikáját lehet ellenőrizni.",
  "research.publications.pragmatingVerification": "Az IncQuery Labs és NASA JPL munkatársaival közösen kidolgoztunk egy módszert ipari méretű végrehajtható SysML modellek formális ellenőrzésére.",

  "research.projects.edgeskills": "Az EDGE-Skills project célja, hogy innovatív felhő- és peremszolgáltatásokat fejlesszen és telepítsen oktatási és képzési adatterekhez (data space), és az adattereket elérhetővé tegye privát és publikus szervezetek számára.",
  "research.projects.openscaling": "Az OpenSCALING projekt célja, hogy a nyílt szabványokat és meglévő modellezési és szimulációs eszközöket továbbfejlessze, hogy jobban támogassák az energiafelhasználás csökkentését lehetővé tevő nagyméretű rendszereket és elosztott vezérlőket.",
  "research.projects.AWS": "A McGill Egyetemmel közösen elnyertünk egy Amazon Research Award díjat a Graph Solver as a Service című pályázatunkkal. A pályázat során a gráfgeneráló algoritmusainkat és a hozzá tartozó adatszerkezeteket terveztük újra és fejlesztettük tovább, hogy felhő környezetben is tudjanak skálázódni.",
  "research.projects.KK": "A BME négy nagyvállalattal együttműködve létrehozott egy Biztonságtudományi és Technológiai Kompetencia Központot. Kutatócsoportunk a thyssenkrupp vállalattal együttműködve olyan új modellezési és analízis módszereket és eszközöket dolgozott ki, amikkel biztonságkritikus rendszerek fejlesztése hatékonyabbá tehetők.",
  "research.projects.SME4DD": "Az SME4DD projekt célja rövid távú képzési programok kidolgozása és megtartása, amiknek a segítségével az európai munkaerő továbbképezhető a kulcsfontosságú digitális területeken: mesterséges intelligencia, kiberbiztonság és blokklánc technológiák. Kutatócsoportunk a blokklánc területért felelős.",
  "research.projects.ADVANCE": "A BME részvételével 2019 januárjában elindult az „Addressing Verification and Validation Challenges in Future Cyber-Physical Systems” (ADVANCE) nevű H2020 RISE kutatási projekt, ami a jövő kiberfizikai rendszereinek ellenőrzési kihívásait fogja vizsgálni. A projekt futamideje 4 év és teljes költségvetése € 657 800.",
  "research.projects.arrowheadtools": "A BME TMIT és MIT részvételével 2019 májusában elindult az „Arrowhead Tools” H2020 ECSEL projekt, ami Európa legnagyobb, ipari digitalizációs és automatizálási megoldásokat fejlesztő K+F+I projektje. A projektben több mint 80 partner vesz részt, köztük az AITIA, evopro Innovation és az IncQuery Labs.",
  "research.projects.blockchain": "Az EIT Digital Professional School keretében kidolgozunk egy olyan tanfolyamsorozatot, ami bemutatja, hogy hogyan lehet a blockchain technológiákat beépíteni egy cég üzletmenetébe és innovatív szolgáltatásaiba.",
  "research.projects.EMBrACE": "A BME részvételével elindult az „Environment for model-based rigorous adaptive co-design and operation of CPS” (EMBrACE) című ITEA 3 projekt. Az IncQuery Labs és további húsz partner együttműködésével készítünk komplex ipari rendszerek tervezéséhez innovatív mérnöki nyelveket és eszközöket.",
  "research.projects.allPrevious.title": "Korábbi projektjeink",
  "research.projects.allPrevious.subtitle": "FP4-től H2020-ig",
  "research.projects.allPrevious.desc": "EU keretprogramok (EEMCN, FUTEG, HIDE, DECOS, RESIST, Sensoria, Deserec, Diana, Hidenets, SafeDMI, Amber, Genesys, Mogentes, SecureChange, E-freight, R3-COP, CECRIS, Concerto, MONDO, R5-COP...) és hazai kutatási pályázatok (MTA Lendület, ERC_HU, OTKA...)",

  "research.events.disc2019.title": "DISC 2019",
  "research.events.disc2019.subtitle": "33rd Int. Symposium on Distributed Computing",
  "research.events.disc2019.desc": "Kutatócsoportunk szervezte az International Symposium on Distributed Computing (DISC) konferenciát 2019. október 14-18. között Budapesten. A DISC egy nemzetközi, elismert akadémiai konferencia, aminek a témája az elosztott rendszerek és hálózatok elmélete, tervezése, analízise és alkalmazása.",
  "research.events.acadAwardPataricza.title": "Akadémiai Díj",
  "research.events.acadAwardPataricza.subtitle": "MTA Akadémiai Díj Pataricza András részére",
  "research.events.acadAwardPataricza.desc": "A díj elismerte a kritikus informatikai infrastruktúrák és a kiberfizikai rendszerek elméleti megalapozását, tervezését és fejlesztését célzó példaértékű munkásságát, a hibatűrés terén nemzetközileg is ismert iskolateremtő tudományos tevékenységét, valamint a tudományos utánpótlás nevelésében elért eredményeit.",
  "research.events.models2020.title": "MODELS Most influential paper",
  "research.events.models2020.subtitle": "Legnagyobb hatású cikk a MODELS 2020 konferencián",
  "research.events.models2020.desc": "Kutatócsoportunk jelenlegi és korábbi munkatársai vehették át a „Legnagyobb hatású cikk” díját a modellalapú rendszer- és szoftvertervezés legrangosabb nemzetközi tudományos fórumán az „Incremental Evaluation of Model Queries over EMF Models” című, a MODELS 2010 konferencián bemutatott publikációjukért.",
  "research.events.sosym2021.title": "SoSyM Most influential paper",
  "research.events.sosym2021.subtitle": "Legnagyobb hatású cikk a SoSyM folyóiratban",
  "research.events.sosym2021.desc": "Micskei Zoltán és Hélène Waeselynck vehették át a „Legnagyobb hatású cikk” díjat a Software and Systems Modeling, a modellalapú rendszer- és szoftvertervezés legrangosabb nemzetközi tudományos folyóiratában 10 évvel ezelőtt megjelent „The many meanings of UML 2 Sequence Diagrams: a survey” című publikációjukért.",
  "research.events.fka2022.title": "Fiatal Kutatók Akadémiája",
  "research.events.fka2022.subtitle": "Micskei Zoltán FKA tag lett",
  "research.events.fka2022.desc": "A Fiatal Kutatók Akadémiája 2022-ben tagjai közé választotta Micskei Zoltánt. Az Akadémia minden évben 12 új tagot választ a 40 év alatti kiemelkedő eredményt elért kutatók közül eddig tudományos teljesítményük és a fiatal kutatókat segítő terveiket bemutató pályázatuk alapján.",
  "research.events.mta2022.title": "Akadémiai Ifjúsági Díj",
  "research.events.mta2022.subtitle": "Akadémiai Ifjúsági Díj Semeráth Oszkár részére",
  "research.events.mta2022.desc": "A Magyar Tudományos Akadémia (MTA) 2021-ben Akadémiai Ifjúsági Díjban részesítette Semeráth Oszkárt az „Autonóm járművek ellenőrzése gráfalapú következtetéssel” című pályamunkájáért. A díjat 35 év alatti fiatalokat kaphatják kiemelkedő tudományos eredményeik elismerésére."
}
